# CannotDrawRevolution Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RevolutionFailures..::..CannotDrawRevolution Property
BuiltInFailures..::..RevolutionFailures Class See Also
---
Can't create surface of revolution.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDrawRevolution { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDrawRevolution As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDrawRevolution {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RevolutionFailures Class
Autodesk.Revit.DB Namespace